app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.new(params.require(:school_class).permit(:title, :room_number))
        @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "sdlfkdslkfj"], ["room_number", 2], ["created_at", "2020-10-06 21:14:55.345848"], ["updated_at", "2020-10-06 21:14:55.345848"]]

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class = SchoolClass.update(params.require(:school_class).permit(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "sdlfkdslkfj"], ["room_number", 2], ["updated_at", "2020-10-06 21:25:08.461606"], ["id", 1]]